Model: "Dense to dense"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d (Conv2D)                              (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)                 (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                            (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)               (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
dense (Dense)                                (None, 2, 2, 120)                       15480          
____________________________________________________________________________________________________
dense_1 (Dense)                              (None, 2, 2, 60)                        7260           
____________________________________________________________________________________________________
dense_8 (Dense)                              (None, 2, 2, 10)                        610            
====================================================================================================
Total params: 97,846
Trainable params: 97,846
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "Dense to recurrent"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_2 (Conv2D)                            (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)               (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                            (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)               (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
flatten (Flatten)                            (None, 512)                             0              
____________________________________________________________________________________________________
dense_2 (Dense)                              (None, 120)                             61560          
____________________________________________________________________________________________________
reshape (Reshape)                            (None, 60, 2)                           0              
____________________________________________________________________________________________________
simple_rnn (SimpleRNN)                       (None, 128)                             16768          
____________________________________________________________________________________________________
dropout (Dropout)                            (None, 128)                             0              
____________________________________________________________________________________________________
dense_9 (Dense)                              (None, 10)                              1290           
====================================================================================================
Total params: 154,114
Trainable params: 154,114
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "Dense to LSTM"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_4 (Conv2D)                            (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)               (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                            (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)               (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
dense_3 (Dense)                              (None, 2, 2, 120)                       15480          
____________________________________________________________________________________________________
time_distributed (TimeDistributed)           (None, 2, 128)                          127488         
____________________________________________________________________________________________________
flatten_1 (Flatten)                          (None, 256)                             0              
____________________________________________________________________________________________________
dense_10 (Dense)                             (None, 10)                              2570           
====================================================================================================
Total params: 220,034
Trainable params: 220,034
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "Dense to GRU"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_6 (Conv2D)                            (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)               (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                            (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)               (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
dense_4 (Dense)                              (None, 2, 2, 120)                       15480          
____________________________________________________________________________________________________
reshape_1 (Reshape)                          (None, 4, 120)                          0              
____________________________________________________________________________________________________
gru (GRU)                                    (None, 128)                             96000          
____________________________________________________________________________________________________
dense_11 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 187,266
Trainable params: 187,266
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "LSTM to LSTM"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_8 (Conv2D)                            (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)               (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                            (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)               (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
time_distributed_1 (TimeDistributed)         (None, 2, 128)                          131584         
____________________________________________________________________________________________________
lstm_2 (LSTM)                                (None, 128)                             131584         
____________________________________________________________________________________________________
flatten_2 (Flatten)                          (None, 128)                             0              
____________________________________________________________________________________________________
dense_12 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 338,954
Trainable params: 338,954
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "LSTM to dense"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_10 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_11 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
time_distributed_2 (TimeDistributed)         (None, 2, 128)                          131584         
____________________________________________________________________________________________________
flatten_3 (Flatten)                          (None, 256)                             0              
____________________________________________________________________________________________________
dense_5 (Dense)                              (None, 60)                              15420          
____________________________________________________________________________________________________
dense_13 (Dense)                             (None, 10)                              610            
====================================================================================================
Total params: 222,110
Trainable params: 222,110
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "LSTM to recurrent"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_12 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_13 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
time_distributed_3 (TimeDistributed)         (None, 2, 128)                          131584         
____________________________________________________________________________________________________
simple_rnn_1 (SimpleRNN)                     (None, 128)                             32896          
____________________________________________________________________________________________________
dense_14 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 240,266
Trainable params: 240,266
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "LSTM to GRU"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_14 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_15 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
time_distributed_4 (TimeDistributed)         (None, 2, 128)                          131584         
____________________________________________________________________________________________________
gru_1 (GRU)                                  (None, 128)                             99072          
____________________________________________________________________________________________________
dense_15 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 306,442
Trainable params: 306,442
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "GRU to GRU"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_16 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_17 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_2 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
gru_2 (GRU)                                  (None, 4, 64)                           37248          
____________________________________________________________________________________________________
gru_3 (GRU)                                  (None, 128)                             74496          
____________________________________________________________________________________________________
dense_16 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 187,530
Trainable params: 187,530
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "GRU to LSTM"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_18 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_19 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_3 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
gru_4 (GRU)                                  (None, 4, 64)                           37248          
____________________________________________________________________________________________________
lstm_6 (LSTM)                                (None, 128)                             98816          
____________________________________________________________________________________________________
dense_17 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 211,850
Trainable params: 211,850
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "GRU to dense"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_20 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_21 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_4 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
gru_5 (GRU)                                  (None, 64)                              37248          
____________________________________________________________________________________________________
dense_6 (Dense)                              (None, 60)                              3900           
____________________________________________________________________________________________________
dense_18 (Dense)                             (None, 10)                              610            
====================================================================================================
Total params: 116,254
Trainable params: 116,254
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "GRU to recurrent"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_22 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_23 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_23 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_5 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
gru_6 (GRU)                                  (None, 4, 64)                           37248          
____________________________________________________________________________________________________
simple_rnn_2 (SimpleRNN)                     (None, 128)                             24704          
____________________________________________________________________________________________________
dense_19 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 137,738
Trainable params: 137,738
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "recurrent to recurrent"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_24 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_25 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_6 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
simple_rnn_3 (SimpleRNN)                     (None, 4, 128)                          32896          
____________________________________________________________________________________________________
simple_rnn_4 (SimpleRNN)                     (None, 60)                              11340          
____________________________________________________________________________________________________
dense_20 (Dense)                             (None, 10)                              610            
====================================================================================================
Total params: 119,342
Trainable params: 119,342
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "recurrent to GRU"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_26 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_26 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_27 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_27 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_7 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
simple_rnn_5 (SimpleRNN)                     (None, 4, 128)                          32896          
____________________________________________________________________________________________________
gru_7 (GRU)                                  (None, 64)                              37248          
____________________________________________________________________________________________________
dense_21 (Dense)                             (None, 10)                              650            
====================================================================================================
Total params: 145,290
Trainable params: 145,290
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "recurrent to dense"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_28 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_28 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_29 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_29 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_8 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
simple_rnn_6 (SimpleRNN)                     (None, 128)                             32896          
____________________________________________________________________________________________________
dense_7 (Dense)                              (None, 60)                              7740           
____________________________________________________________________________________________________
dense_22 (Dense)                             (None, 10)                              610            
====================================================================================================
Total params: 115,742
Trainable params: 115,742
Non-trainable params: 0
____________________________________________________________________________________________________
Model: "recurrent to LSTM"
____________________________________________________________________________________________________
Layer (type)                                 Output Shape                            Param #        
====================================================================================================
conv2d_30 (Conv2D)                           (None, 26, 26, 64)                      640            
____________________________________________________________________________________________________
max_pooling2d_30 (MaxPooling2D)              (None, 8, 8, 64)                        0              
____________________________________________________________________________________________________
conv2d_31 (Conv2D)                           (None, 6, 6, 128)                       73856          
____________________________________________________________________________________________________
max_pooling2d_31 (MaxPooling2D)              (None, 2, 2, 128)                       0              
____________________________________________________________________________________________________
reshape_9 (Reshape)                          (None, 4, 128)                          0              
____________________________________________________________________________________________________
simple_rnn_7 (SimpleRNN)                     (None, 4, 128)                          32896          
____________________________________________________________________________________________________
lstm_7 (LSTM)                                (None, 128)                             131584         
____________________________________________________________________________________________________
dense_23 (Dense)                             (None, 10)                              1290           
====================================================================================================
Total params: 240,266
Trainable params: 240,266
Non-trainable params: 0
____________________________________________________________________________________________________
